<script setup>

</script>

<template>
  <section class="about-us">
    <h2 class="about-us__header">О компании</h2>
    <div>
      <p class="about-us__content">
        "Компания «Графская кухня» основана в 1924 году в Воронежской области.
        Начав с деревообработки, предприятие эволюционировало к мебельному
        производству, а с 1992 года стало одним из первых в России
        производителей мебели по индивидуальным заказам.
      </p>

      <br />

      <p class="about-us__content">
        С самого начала компания зарекомендовала себя как поставщик качественной
        продукции. Со временем модели стали уникальными, но безупречное качество
        осталось неизменным. Бренд непрерывно модернизируется, используя
        немецкое высокоточное оборудование и экологичные материалы от
        проверенных поставщиков.
      </p>

      <br />

      <p class="about-us__content">
        «Графская кухня» предлагает около 300 моделей с разнообразными фасадными
        решениями из массива дерева, МДФ, акрила и других материалов. Компания
        сертифицирована по международным стандартам качества ISO 9001, что
        гарантирует высочайший уровень продукции и соблюдение сроков.
      </p>

      <br />

      <p class="about-us__content">
        Сегодня это одно из крупнейших и наиболее динамично растущих предприятий
        России в сегменте кухонной мебели, неоднократно отмеченное на
        международных выставках за качество и инновации."
      </p>
    </div>
  </section>
</template>

<style src="./style.scss"></style>
