<script setup>
import TheReview from "@components/shared/review/TheReview.vue";
import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/scrollbar";

const reviews = [
  {
    name: "Алина Лесникова",
    avatar: "",
    image: "",
    id: 1,
    price: 375000,
    review:
      "Обратились в Графскую кухню к Кристине, и сразу же было принято решение заказывать кухню здесь! Адекватные цены , вежливые сотрудники, прекрасный подход к клиентам . Кристина просто профессионал своего дела, все быстро, четко и по делу . Остались очень довольны, ждем с нетерпением нашу кухню.",
    rate: 5,
    date: "1 августа 2024",
  },
  {
    name: "Анастасия Рошка",
    avatar: "/images/avatars/roshkaA.webp",
    image: "/images/reviews/roshka_1.webp",
    id: 2,
    price: 643400,
    review:
      "Всем здравствуйте !!! Я под огромным впечатлением от кухни!Дизайнер Кристина хорошо понимает чего хочет клиент и ловко подбирает нужное, она на ура справляется со всеми трудностями кухни, ведь выступающую стену на которой повешан котел не каждый сможет ее так стильно обыграть!!! Мне абсолютно все понравилось 🥰, даже косяк с ручками 😅, потому что скобы в низу смотреться лучше и гармонично!!! Такая огромная и вместительная кухня!!! Мечта любой женщины!!! 😅 Очень понравилась цветовая гамма, в живую смотрится намного круче !!! А как приятно трогать эту пленку, не передать словами 🥰 большое спасибо за такое творение и за проделанную работу, ведь с людьми всегда сложно ( желаю вам побольше дружелюбных клиентов и поменьше вредных людей! Хочу выделить, то как вы грамотно и оперативно выходите из конфликтной ситуации, вы профессионалы своего дела! Буду всем рекомендовать Графскую Кухню и выбирать дизайнера Кристину!!!❤️🫶 Отдельно хочу сказать спасибо, что Павел подобрал очень хорошего сборщика Сергея. Он все сделал весьма быстро и качественно, рассказал о еврозапиле, что не стоит оставлять влажный или мокрый пололонец может вздуться!",
    rate: 5,
    date: "16 июля 2024",
  },
  {
    name: "Оксана Гаврилюк",
    avatar: "",
    image: "",
    id: 3,
    price: 423100,
    review:
      "Приобрели кухню в Графских кухнях на Воронежском рынке (4 этаж). Очень довольны. Проект делала Кристина. Учла все наши пожелания. Зоны для хранения. Размеры полок. Место для техники. Мастера-сборщики установили нашу кухню за два дня. Работали очень аккуратно. Огромное спасибо.",
    rate: 5,
    date: "10 марта 2024",
  },
  {
    name: "Анастасия Г.",
    avatar: "/images/avatars/anatasiaG.webp",
    image: "/images/reviews/anastasiaG_1.webp",
    id: 4,
    price: 314400,
    review:
      "От всего сердца хочется поблагодарить сотрудников «Графской кухни» Кристину и Петра (Воронежский рынок, 4 этаж). Заказывали кухню в декабре 2023г. И Как оказалось, они специализируется не только на кухнях, но и на ванных комнатах, смогут сделать прихожую или шкаф в гостиную. Поэтому мы еще ни раз обратимся к ним. Спасибо фабрике за отличное производство, очень качественные материалы и комплектующие, фурнитура. Спасибо за возможность воплотить практически любой дизайн и подобрать такую функциональность, которая нужна именно нам. Спасибо дизайнеру Кристине за внимательное отношение и умение слышать все пожелания. Спасибо сотрудникам доставки, которые аккуратно и в согласованные сроки привезли заказ. Спасибо сборщикам, это супер-команда, качество сборки и организация процесса сборки выше всяких похвал. Кухня стала частью домашнего уюта и комфорта. Пока только положительные эмоции и результат выше моих ожиданий. Также ценно, что если вдруг что-то пошло не так, то все сотрудники готовы прийти на помощь и найти решение. Спасибо! Удачи и отличных клиентских проектов💞",
    rate: 5,
    date: "10 марта 2024",
  },
  {
    name: "Анастасия М.",
    avatar: "/images/avatars/anastasiaM.webp",
    image: "/images/reviews/anastasiaM_1.webp",
    id: 5,
    price: 425200,
    review:
      "Выражаю огромную благодарность Кристине и Петру,за мою замечательную, комфортную, уютную и уже оооочень любимую кухню!!! Профессиональная помощь при обсуждении проекта, учтены все нюансы помещения и интерьера, супер! Я даже не представляю другого варианта, как-будто ребята знают, что именно нужно каждому клиенту. Все продумано до мелочей. Всё быстро, качественно, на высшем уровне! Цвет кухни получился очень красивый,именно то что я и хотела ,что и сказать очень довольна внешним видом и расположением шкафом. Все удобно открывается, современно и продуманно.Плюс подобрали технику сразу же. Так же хотела выразить благодарность сборщику кухни Николаю ,собрал кухню и установил технику быстро ,а главное качественно ! Обязательно буду рекомендовать своим близким!",
    rate: 5,
    date: "16 февраля 2024",
  },
  {
    name: "Юлия Штефанеса",
    avatar: "",
    image: "",
    id: 6,
    price: 280500,
    review:
      "Никогда не писала отзывов ни на одном сайте, но в этом случае не могу пройти мимо. Заказали кухню в магазине «Графская кухня» в ТЦ «Воронежский». Описать свой восторг после ее установки невозможно. Особенно хочу отдельное спасибо сказать ребятам, которые помогли нам — Кристине, Петру и Андрею. После оформления заказа я передумала с цветом, Кристина быстро помогла все переоформить, подобрать дополнительную фурнитуру и технику, за что ей огромное спасибо. Отдельного спасибо заслуживают сборщики Николай и Роман, ребята большие молодцы не только в своём деле, но и в коммуникабельности. По десятибалльной шкале всей команде ставлю двадцать.",
    rate: 5,
    date: "23 сентября 2023",
  },
  {
    name: "Наталия Литвинова",
    avatar: "",
    image: "",
    id: 7,
    price: 424000,
    review:
      "Остановила свой выбор на Графской кухне, расположенной в здании Воронежского рынка на Московском проспекте по рекомендации своих соседей. Очень внимательное отношение к клиентам. Индивидуальный подход. Понимание современных тенденций. Оформляла свой заказ у Кристины, осталась довольна ее работой и советами.",
    rate: 5,
    date: "10 февраля 2024",
  },
  {
    name: "SERG Bodrij",
    avatar: "",
    image: "",
    id: 8,
    price: 563400,
    review:
      "Заказал кухню в салоне Графская кухня Работали с дизайнером Кристиной. Проработали проект кухни быстро и по нашим пожеланиям . Подарили мойку и вытяжку нам ) Большое спасибо Вам !!!Кухню и технику привезли через два месяца ,все собрали четко за 1 день ,мы довольны!",
    rate: 5,
    date: "7 июня 2023",
  },
  {
    name: "Яна Кучерова",
    avatar: "/images/avatars/kycherovaY.webp",
    image: "/images/reviews/yanaK_1.webp",
    id: 9,
    price: 456300,
    review:
      "Долго выбирали и сравнивали цены . Кристина слелала нам очень красивый поект , премиального качества, по очень приятной цене. Мы остались очень довольны.",
    rate: 5,
    date: "19 августа 2023",
  },
  {
    name: "Бочарова Елена",
    avatar: "/images/avatars/bocharovaE.webp",
    image: "",
    id: 10,
    price: 384400,
    review:
      "Долго выбирали где заказать кухню, ходили считали по разным салонам. В Графской кухни оказался очень большой выбор и приятные цены. Очень понравилась дизайнер Кристина, учла все наши пожелания и подарила каменные разделочные доски, которые отлично подошли к нашей новой кухни. Кухня была изготовлена раньше срока заявленного в договоре, это тоже очень порадовало. При установке был обнаружен брак на столешнице, сотрудники очень оперативно заменили полностью всю столешницу абсолютно бесплатно. Всегда были на связи, отвечали на все вопросы. Кухня получилась именно такая как мы мечтали!",
    rate: 5,
    date: "5 июня 2023",
  },
  {
    name: "Виктория Ознобкина",
    avatar: "/images/avatars/oznobkinaV.jpg",
    image: "",
    id: 11,
    price: 546800,
    review:
      "Монтаж кухни прошёл быстро и без лишних хлопот. Команда профессионалов работала слаженно и аккуратно. Результат превзошёл все ожидания: кухня выглядит стильно и функционально.",
    rate: 5,
    date: "11 апреля 2025",
  },
  {
    name: "Дарья Паринова",
    avatar: "",
    image: "",
    id: 12,
    price: 452400,
    review:
      "Хочу поблагодарить за помощь в разработке дизайна, включая все критерии нашей квартиры, осталась довольна работой Валерия, будем обращаться и советовать Вас!",
    rate: 5,
    date: "10 апреля 2025",
  },
  {
    name: "Екатерина Халеева",
    avatar: "/images/avatars/haleevaE.jpg",
    image: "",
    id: 13,
    price: 341800,
    review:
      "Долго искали салон, в итоге остановились на Графской кухне. Прекрасный персонал и адекватные цены! Нам помогал с выбором и планировкой кухни Андрей, очень приятный молодой человек!\n" +
      "Учел все наши пожелания, приятно было работать!",
    rate: 5,
    date: "9 октября 2024",
  },
  {
    name: "Алина Шумкина",
    avatar: "/images/avatars/shumkinaA.jpg",
    image: "",
    id: 14,
    price: 445200,
    review:
      "Достаточно долго выбирали место в котором закажем кухню, по рекомендации знакомых обратились в Графскую кухню к Кристине , после общения с ней мы сразу же поняли , что будем заказывать кухню здесь! Кристина поняла нас с полуслова , помогла определиться с дизайном кухни, помогла в выборе цветов , подсказала по раковине , крану , вытяжке и еще по многим другим вопросам . Будем всем рекомендовать данное место и замечательную Кристину !",
    rate: 5,
    date: "1 августа 2024",
  },
  {
    name: "Мария Чепрасова",
    avatar: "/images/avatars/cherepasova.jpg",
    image: "/images/reviews/mariaCh_1.jpg",
    id: 15,
    price: 435600,
    review:
      "Когда в процессе ремонта дело дошло до выбора кухни, мы знали к кому обратиться, потому что у нас уже была кухня, спроектированная дизайнерами ГК, которая 20 лет радует нас своим видом и качеством!\n" +
      "В этот раз дизайнер Кристина помогла нам построить проект не только красивой, но и удобной и функциональной кухни, подобрать качественную технику, которая судя по отзывам прослужит нам много лет :)",
    rate: 5,
    date: "4 февраля 2024",
  },
  {
    name: "Илона Шенгелия",
    avatar: "",
    image: "/images/reviews/ilonaSh_1.jpg",
    id: 16,
    price: 561400,
    review:
      "Купила гардеробную и мебель в ванную комнату в салоне Графская кухня на Московский проспект 90/1\n" +
      "Работали над проектами с дизайнером Палютиной Кристиной, хотела попасть именно к ней т. к ее рекомендовали мои знакомые и я не разочаровалась !!! Хочу поблагодарить за профессиональную работу, честность во многих нюансах, и классный нестандартный проект который мне очень понравился! Жду теперь с нетерпением свою мебель) 🌸🌸🌸",
    rate: 5,
    date: "4 февраля 2024",
  },
  {
    name: "Наталья Д.",
    avatar: "/images/avatars/nataliaD.jpg",
    image: "",
    id: 17,
    price: 313000,
    review:
      'Когда встал вопрос покупки кухни, мы рассматривали различные варианты. Мебель на кухню приобретается на достаточно долгий срок, поэтому хотелось хорошего качества и известного производителя "с именем".\n' +
      "В результате многочисленных походов по магазинам, было принято решение остановиться на ГК.\n" +
      "От момента заказа до полной установки прошло чуть меньше 3х месяцев. Не быстро конечно, но морально я была к этому готова.\n" +
      "Зато в результате получили то, что и хотели.\n" +
      "Кстати, они делают не только кухни! Нам ещё сделали прекрасный стеллаж с рабочим местом под нужный размер",
    rate: 4,
    date: "9 ноября 2023",
  },
  {
    name: "Юлия Штефанеса",
    avatar: "",
    image: "",
    id: 18,
    price: 345200,
    review:
      "Никогда не писала отзывов ни на одном сайте, но в этом случае не могу пройти мимо. Заказали кухню в магазине «Графская кухня» в ТЦ «Воронежский». Описать свой восторг после ее установки невозможно. Особенно хочу отдельное спасибо сказать ребятам, которые помогли нам — Кристине, Петру и Андрею. После оформления заказа я передумала с цветом, Кристина быстро помогла все переоформить, подобрать дополнительную фурнитуру и технику, за что ей огромное спасибо. Отдельного спасибо заслуживают сборщики Николай и Роман, ребята большие молодцы не только в своём деле, но и в коммуникабельности. По десятибалльной шкале всей команде ставлю двадцать.",
    rate: 5,
    date: "23 сентября 2023",
  },
  {
    name: "Карина Кирнос",
    avatar: "",
    image: "/images/reviews/karinaK_1.jpg",
    id: 19,
    price: 662000,
    review:
      "Хотим выразить благодарность Кристине и Петру за нашу чудесную кухню.\n" +
      "Долго выбирали, ходили в разные салоны, но все было не то, то не было подходящих материалов, то технической возможности или была очень высокая цена. Пришли в салон Графская кухня на Воронежском рынке и в тот же день оформили покупку. Кристина поймала наше настроение и поняла, что нам нужно. Кухня была готова раньше срока, доставили приятные люди, аккуратно занесли; через день приехали сборщики, тоже интелегетные ребята, кухню собрали и подключили технику без каких-либо сложностей, аккуратно, все ровно, без косяков. Кристина и Петр всегда были на связи, отвечали на все вопросы и сдерживали свое слово. Мы очень рады, что решили работать с ними, наша кухня мечты воплотилась в жизнь❤️",
    rate: 5,
    date: "19 июня 2023",
  },
  {
    name: "Светлана Лихачева",
    avatar: "/images/avatars/lihachovaS.jpg",
    image: "/images/reviews/svetalanaL_1.jpg",
    id: 20,
    price: 614000,
    review:
      "Очень рекомендую всем, особенно кто сомневается, заказать именно здесь кухню мечты. Грамотные и добродушные Петр и Кристина помогут, посоветуют, всё расскажут, покажут, объяснят. Специально для вас сделают продуманный во всех отношениях проект. Нам еще и подарков надарили. Сборщик Николай супер специалист, мастер своего дела, за 1 день всё собрал, подключил. Гарнитур получился очень красивый. Качественные материалы. Всё четко, ровно. Все зазорчики ровные. Однозначно рекомендую!",
    rate: 5,
    date: "29 мая 2023",
  },
];

import { Swiper, SwiperSlide } from "swiper/vue";
import { Autoplay, Navigation } from "swiper/modules";
</script>
<template>
  <section class="our-reviews">
    <div class="our-reviews__total-review">
      Всего отзывов: <span>{{ reviews.length }}</span>
    </div>
    <div class="our-reviews__swiper-wrapper">
      <Swiper
        class="our-reviews__swiper"
        :modules="[Autoplay, Navigation]"
        :navigation="{
          nextEl: '.swiper-button-next',
          prevEl: '.swiper-button-prev',
        }"
        :space-between="10"
        :loop="true"
        :speed="1500"
        :autoplay="{ delay: 5000, pauseOnMouseEnter: true }"
        :breakpoints="{
          0: {
            slidesPerView: 1,
            spaceBetween: 10,
          },
          768: {
            slidesPerView: 2,
            spaceBetween: 10,
          },
          1200: {
            slidesPerView: 3,
            spaceBetween: 10,
          },
        }"
      >
        <SwiperSlide v-for="review in reviews" :key="review.id">
          <TheReview :item="review" />
        </SwiperSlide>
        <template #container-end>
          <div class="swiper-button-prev"></div>
          <div class="swiper-button-next"></div>
        </template>
      </Swiper>
    </div>
  </section>
</template>

<style src="./style.scss"></style>
