<script setup></script>
<template>
  <h1>Условия использования персональных данных</h1>
  <div>
    1. Общие положения

Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые [Ваше ИП/ФИО, если сайт на физлице] (далее — Оператор).

1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.

1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта [Адрес вашего сайта, например: https://мой-сайт.ru].

2. Основные понятия, используемые в Политике

2.1. Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств вычислительной техники.

2.2. Персональные данные (ПДн) — любая информация, относящаяся прямо или косвенно к определенному или определяемому физическому лицу (субъекту персональных данных).

2.3. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.

2.4. Субъект персональных данных (Пользователь) — посетитель сайта [Адрес вашего сайта], предоставивший свои персональные данные через форму обратной связи.

3. Оператор может обрабатывать следующие персональные данные Пользователя

3.1. Фамилия, имя, отчество.

3.2. Номер телефона.

3.3. Адрес электронной почты.

3.4. Текст произвольного сообщения, которое Пользователь указывает в форме.

3.5. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс.Метрика, Google Analytics и других).

4. Цели обработки персональных данных

4.1. Цель обработки персональных данных Пользователя — исключительно установление контакта с Пользователем, обработка его запроса или заказа, направленного через форму обратной связи на сайте.

4.2. Оператор также имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты [Ваш email] с пометкой «Отказ от уведомлений».

4.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.

5. Правовые основания обработки персональных данных

5.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.

5.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).

6. Порядок сбора, хранения, передачи и других видов обработки персональных данных

Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.

6.1. Ключевой принцип: Данные, полученные через форму обратной связи, не хранятся и не накапливаются на сервере сайта. Они в реальном времени передаются в зашифрованном виде на мессенджер Telegram (или на электронную почту) Оператору для дальнейшей связи с Пользователем.

6.2. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.

6.3. Срок хранения: Персональные данные Пользователя хранятся Оператором в истории переписки (в Telegram или электронной почте) не более 3 (трех) лет с момента последнего взаимодействия, если иное не предусмотрено договоренностью с Пользователем (например, для исполнения гарантийных обязательств).

6.4. По истечении указанного срока хранения персональные данные подлежат уничтожению.

7. Передача персональных данных

7.1. Оператор не передает и не раскрывает третьим лицам персональные данные Пользователей, за исключением случаев, прямо предусмотренных законодательством РФ.

8. Права субъекта персональных данных (Пользователя)

8.1. Пользователь имеет право:

Получить информацию, касающуюся обработки его персональных данных.

Уточнить свои персональные данные, заблокировать или уничтожить их, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки.

Отозвать свое согласие на обработку персональных данных, направив Оператору соответствующее уведомление по электронной почте [Ваш email].

На защиту своих прав и законных интересов, в том числе на возмещение убытков и/или компенсацию морального вреда в судебном порядке.

8.2. Для реализации своих прав и законных интересов Пользователь вправе обратиться к Оператору с запросом, содержащим сведения, указанные в ч. 3 ст. 14 Закона о персональных данных. Оператор обязан дать ответ в течение 30 дней с момента получения такого запроса.

9. Заключительные положения

9.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору по электронной почте [Ваш email].

9.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.

9.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу [Ссылка на эту страницу, например: https://мой-сайт.ru/privacy].
  </div>
</template>
